app/views/options/show.html.erb

  </tr>
  <% @option.factors.each do |fact| %>
---
SELECT "factors".* FROM "factors" WHERE "factors"."option_id" = ?  [["option_id", 9]]