app/views/dilemmas/_form.html.erb

  <%= d.label "existing tags:" %>
  <%= d.collection_check_boxes :tag_ids, Tag.all, :id, :name %><br>
---
SELECT "tags".* FROM "tags"