app/views/dilemmas/overdue.html.erb

<% if current_user.overdue_dilemmas.first %>
---
SELECT "dilemmas".* FROM "dilemmas" WHERE "dilemmas"."user_id" = ?  [["user_id", 1]]