app/views/dilemmas/show.html.erb

SELECT "options".* FROM "options" WHERE "options"."dilemma_id" = ?  [["dilemma_id", 1]]
---
  </tr>
  <% @dilemma.options.each do |opt| %>