app/controllers/comments_controller.rb

  def create
    @comment = Comment.create(comment_params)
---
INSERT INTO "comments" ("content", "commenter_id", "dilemma_id") VALUES (?, ?, ?)  [["content", "don't be trump, he sucks"], ["commenter_id", 3], ["dilemma_id", 3]]

  def destroy
    @comment = Comment.find_by(id: params[:id])
    @comment.delete
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]