app/controllers/dilemmas_controller.rb

  def create
    @dilemma = current_user.dilemmas.create(dilemma_params)
---
INSERT INTO "dilemmas" ("name", "user_id", "deadline") VALUES (?, ?, ?)  [["name", "what to do for a date friday"], ["user_id", 1], ["deadline", Fri, 23 Sep 2016]]

  def update
    set_dilemma
    @dilemma.update(dilemma_params)
---
UPDATE "dilemmas" SET "name" = ? WHERE "dilemmas"."id" = ?  [["name", "new dilemm"], ["id", 5]]

  def show
    set_dilemma
    if @dilemma.author == current_user
      current_user.current_dilemma = current_user.dilemmas.find_by(id: params[:id])
---
SELECT  "dilemmas".* FROM "dilemmas" WHERE "dilemmas"."user_id" = ? AND "dilemmas"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]

  def index
    @dilemmas = Dilemma.all
---
SELECT "dilemmas".* FROM "dilemmas"

  def destroy
    set_dilemma
    @dilemma.destroy
---
DELETE FROM "dilemmas" WHERE "dilemmas"."id" = ?  [["id", 5]]

  def set_dilemma
    @dilemma = Dilemma.find_by(id: params[:id])
---
SELECT  "dilemmas".* FROM "dilemmas" WHERE "dilemmas"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]