app/controllers/factors_controller.rb

SELECT  "dilemmas".* FROM "dilemmas" WHERE "dilemmas"."user_id" = ? AND "dilemmas"."id" = ? LIMIT ?  [["user_id", 1], ["id", 4], ["LIMIT", 1]]
SELECT  "options".* FROM "options" WHERE "options"."dilemma_id" = ? AND "options"."id" = ? LIMIT ?  [["dilemma_id", 4], ["id", 10], ["LIMIT", 1]]
---
  def new
    @option = current_user.current_dilemma.options.find_by(id: params[:option_id])

INSERT INTO "factors" ("name", "option_id", "points") VALUES (?, ?, ?)  [["name", "test"], ["option_id", 10], ["points", 6]]
---
  def create
    @factor = Factor.create(factor_params)

SELECT  "factors".* FROM "factors" WHERE "factors"."id" = ? LIMIT ?  [["id", 33], ["LIMIT", 1]]
DELETE FROM "factors" WHERE "factors"."id" = ?  [["id", 33]]
---
  def destroy
    @factor = Factor.find_by(id: params[:id])
    @factor.delete