app/controllers/options_controller.rb

INSERT INTO "options" ("name", "dilemma_id") VALUES (?, ?)  [["name", "points error"], ["dilemma_id", 1]]
---
  def create
    @option = current_user.current_dilemma.options.create(option_params)

UPDATE "options" SET "name" = ? WHERE "options"."id" = ?  [["name", "drive around and get lost, and hang out somewhere in the city"], ["id", 10]]
---
  def update
    set_option
    @option.update(option_params)

DELETE FROM "options" WHERE "options"."id" = ?  [["id", 9]]
---
  def destroy
    set_option
    @option.destroy

SELECT  "options".* FROM "options" WHERE "options"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def set_option
    @option = Option.find_by(id: params[:id])