app/controllers/tags_controller.rb

  def create
    @tag = Tag.create(tag_params)
---
INSERT INTO "tags" ("name") VALUES (?)  [["name", "new tag"]]

  def set_tag
    @tag = Tag.find_by(id: params[:id])
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]