app/views/layouts/_dilemma_tags.html.erb

<% dilemma.tags.collect do |t| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "dilemma_tags" ON "tags"."id" = "dilemma_tags"."tag_id" WHERE "dilemma_tags"."dilemma_id" = ?  [["dilemma_id", 1]]